mdmfile/src/Catalogs/мдмСхемыДанных/мдмСхемыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмСхемыДанных</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитПредставления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>EnumRef.мдмХранилищеДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.мдмСхемыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

mdmfile/src/Enums/мдмХранилищеДанных/мдмХранилищеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мдмХранилищеДанных</name>
  <enumValues>
    <name>Общее</name>
  </enumValues>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>МТР</name>
  </enumValues>
  <enumValues>
    <name>Договоры</name>
  </enumValues>
  <enumValues>
    <name>Кадры</name>
  </enumValues>
  <enumValues>
    <name>Предприятие</name>
  </enumValues>
  <enumValues>
    <name>Расширение</name>
  </enumValues>
</mdclass:Enum>

mdmfile/src/Catalogs/мдмСхемыДанных/ObjectModule.bsl
Перем ИзменилосьНаименование;

#Область ПрограммныйИнтерфейс

Функция КлючОбъекта() Экспорт
	Возврат "Имя";
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ИзменилосьНаименование = Наименование <> Ссылка.Наименование;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ИзменилосьНаименование тогда
		
		Выборка = Справочники.мдмРеквизиты.Выбрать(, Ссылка);
		Пока Выборка.Следующий() цикл
			Объект = Выборка.ПолучитьОбъект();
			Объект.СформироватьПредставление(Наименование);
			Объект.Записать();
		КонецЦикла;	
		
		Выборка = Справочники.мдмТабличныеЧасти.Выбрать(, Ссылка);
		Пока Выборка.Следующий() цикл
			Объект = Выборка.ПолучитьОбъект();
			Объект.СформироватьПредставление(Наименование);
			Объект.Записать();
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Хранилище = Перечисления.мдмХранилищеДанных.Расширение тогда
		ПроверяемыеРеквизиты.Добавить("ИмяРасширения");
		ПроверяемыеРеквизиты.Добавить("ИмяОбъектаРасширения");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
